/*
과제 : 연산자 연습
*/
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main() {
    //우선순위 : 괄호 → 단항(증감) → 산술 → 관계 → 논리 → 대입=복합 → 콤마
    //-----------------------------------------------------------------------------
    // ⓛ산술 연산자 - 우선순위 : 왼 → 오

    // 1) 수식을 산술 연산자로 변환
    // y = m * x + b;
    // y = a * x * x + b * x + c;
    // m = (x + y + z) / 3;
    // f = (a + b * b) / (c - d);
    // y = (2 * x * x * x) / 2 + (3.14 * a * r * r + b) / b;

    // 2) 입력한 두 정수의 사칙연산
    int x, y;
    printf("정수 두 개를 입력하세요.");
    scanf("%d %d", &x, &y);
    printf("1) 덧셈: %d + %d = %d\n", x, y, x + y);
    printf("2) 뺄셈: %d - %d = %d\n", x, y, x - y);
    printf("3) 곱셈: %d * %d = %d\n", x, y, x * y);
    printf("4) 나눗셈: %d / %d = %d\n", x, y, x / y);
    printf("5) 나머지: %d %% %d = %d\n", x, y, x % y);

    // 3) 나머지 연산자 출력
    x = 7, y = 2;
    printf("\"%d %% %d = %d\"\n", x, y, x % y); // "7 % 2 = 1"
    printf("\"%d % %d = %d\"\n", x, y, x & y);  // "7 %d = 2"  ←x&y자리에 y값

    // 4) 한 줄에 다른 변수가 괄호에 들어가는 경우
    x, y = 10 + (x = 2 + 7);
    printf("%d\n", y); // 19

    // 5)
    int i, j, k;
    i = 1.9 + 7 % 2;
    printf("%d\n", i); // 2

    // 6)
    i, j = 7, k = 2;
    i = 1.5 + j / k;
    printf("%d\n", i); // 4

    // 7)
    x = 7, y = 2;
    printf("%d\n", x / y + 0.999); //-1236950581 정수가 아닌 값이 %d로 전달 됨

    // 8)
    x = 7, y = 2; 
    int exp;
    exp = x / y + 0.999;
    printf("%d\n", exp); // 3

    // 9)
    x = 3.9 + 4.1, y = 7 / 2;
    printf("%d\n", x + y); // 11
    // 10)
    i = 0x11, j = 7; // 17 7
    float g;
    g = i + j / 2 + 0.5;
    printf("%f\n", g);     // 20.500000

    // 10)
    int a = 7;
    float f;
    f = a / 2 * 2 + 3.999;
    printf("%f\n", f); // 9.999

    //------------------------------------------------------------------------------
    // ②부호 연산자 - 우선순위 : 오른쪽(우선 결합) → 왼쪽

    // 1) 연습
    x, y = -10;
    x = -y;
    printf("%d\n", x); // 10

    // 2) 연습
    i = 7;
    i = -i;
    i = -i;
    printf("%d\n", i); // 7

    //------------------------------------------------------------------------------
    // ③증감 연산자 - 우선순위 : 오른쪽(우선 결합) → 왼쪽

    // 1)
    i = 0x11, j = 011, k;    // 17, 9
    k = i++ + ++j;
    printf("%d %d %d\n", i, j, k); // 18, 10, 27

    // 2)
    a = 7;
    printf("%d\n", ++a); //8
    printf("%d\n", a++); //8
    printf("%d\n", ++a); //10

    // 3)
    i = 0x11, j = 020, k;            // 17, 16
    k = i++ + ++j;                       // 17, 17, 34 /→ i=18
    printf("%d %d %d\n", i, j, k);       // 18, 17, 34
    k = i-- - --j;                       //18, 16, 2 /→ 17
    printf("%d %d %d\n", --i, ++j, k--); // 16, 17, 2

    // 4)
    i = 3, k;
    k = i++ + ++i;           // 변수를 하나만 쓰면, i=4가 치환되어 8, 사이드 이펙트
    printf("%d %d\n", i, k); // 5 8

    // 5)
    a = 0x10;
    int b = 011, c;
    c = ++a + b++;
    printf("%d %d %d\n", a, b, c); // 17 10 26

    // 6)
    x = 4, y; int z;
    y = --x;
    z = x--;
    printf("%d %d %d\n", x, y, z);

    //------------------------------------------------------------------------------
    // ④대입 연산자 - 우선순위 : 오른쪽 → 왼쪽

    // 1)
    x, y;
    y = x = 3;
    printf("%d %d\n", x, y); // 3 3

    // 2)
    x = 1, y;
    printf("수식 x + 1 의 값은 %d\n", x + 1);              // 2
    printf("수식 y = x + 1 의 값은 %d\n", y = x + 1);      // 2
    printf("수식 y=10+(x=2+7)의 값은 %d\n", y = 10 + (x = 2 + 7)); // 19
    printf("수식 y=x=3의 값은 %d\n", y = x = 3);           //3

    //------------------------------------------------------------------------------
    // ⑤복합 대입 연산자

    // 1)
    i = 3, j = +2;
    i *= (j += 3) + 4;       // j=5
    printf("%d %d\n", i, j); // 27 5

    // 2)
    x = 10, y = 10, z = 33;
    x += 1;       //11
    y *= 2; // 20
    z %= 10 + 20; // 3
    printf("x = %d, y = %d, z = %d\n", x, y, z);

    //------------------------------------------------------------------------------
    // ⑥형변환

    // 1)
    i, j = 7, k = 2;
    i = 1.5 + (float)j / k;
    printf("%d\n", i); // 5

    // 2)
    i, j = 9.99, k = 0.01;
    i = 6.99 + 1. / 100;
    printf("%d\n", i); // 7

    // 3)
    float m;
    j = 7, k = 2;
    printf("%f\n", m = j / k);         // 3.000000
    printf("%f\n", m = (float)j / k);    //3.500000
    printf("%f\n", m = (0.0 + j) / k); //3.500000

    // 4)
    m = (int)5.9 + 0.1;
    printf("%f\n", m); //5.100000

    // 5)
    m = (int)5.9999 + (int)10.0001;
    printf("%f\n", m); // 15.00000

    //------------------------------------------------------------------------------
    // ⑦관계 연산자

    // 1)
    i = 4, j = +2, k = 0;
    printf("%d\n", k != --i >= ++j); //1

    // 2)
    x = 4, z;
    z = 3 < x < 5;
    printf("%d\n", z); // 1

    // 3)
    x = 3, z;
    z = 5 > x > 3;
    printf("%d\n", z); // 0

    // 4)
    x = -1, z;
    z = -3 < x < 0;
    printf("%d\n", z); // 0

    // 5)
    i = 5, j = 2, k;
    k = (i > j) + (j == 2);
    printf("%d\n", k); // 2

    //------------------------------------------------------------------------------
    // ⑧논리 연산자

    // 1)
    x = -3, y;
    y = !(!x);
    printf("%d\n", y); // 1

    // 2)
    x = 4, z;
    z = (x < 5) && (x > 3);
    printf("%d\n", z); // 1

    // 3)
    i = 5, j = 2, k;
    k = (i < 2) && (++j > 2);
    printf("%d\n", k); // 0

    // 4)
    a = 0x11, b = 011, c = 7; int d;
    d = a / b + !(!c);
    printf("%d\n", d); // 2

    // 5)
    x = 0x1, y = 0, z;
    z = (x != y) && (y++);
    printf("%d %d\n", z, y); // 0 1

    // 6)
    x = 0x1, y = 0, z;
    z = (x != y) || (y++); // ||에서 앞의 것이 참이면 뒤에는 실행x
    printf("%d %d\n", z, y); // 1 0 

    // 7)
    a = 14, b = 3, c = -7, d;
    d = a / b + !!c;
    printf("%d\n", d); // 5

    // 8)
    a = 14, b = 3, c = 2, d;
    d = (a > b) && (++c > 2);
    printf("%d\n", d); // 1

    // 9)  단축계산, &&→첫번째 피연산자가 거짓, 다른 피연산자 실행x
    x = 0, y = 0, z;
    z = x && y++;
    printf("%d %d\n", z, y); // 0 0

    // 10) ||에서 첫번째 피연산자가 거짓인 경우, ++y 실행
    x = 0, y = 0, z;
    z = x || ++y;
    printf("%d %d\n", z, y); // 1 1

    // 11)
    a, b, c = -7;
    f = 9.98;
    a = !!c + (int)f + 0.02;
    printf("%d\n", a); // 10

    // 12) ||에서 첫번째 피연산자가 참인 경우, b++은 실행x
    a = 7 / 4, b = -1, c = a || b++;
    printf("%d %d\n", b, c); // -1 1

    // 13) 무주택기간(a) 3년이상, 가구주의 연령(b)이 40세이상, 가족의 수(c)가 3명 이상
    //( a >= 3 ) && ( b >= 40 ) && ( c >= 3 );

    // 14)
    x = 1, y;
    y = (2 > 3) && (++x < 5);
    printf("x=%d y=%d\n", x, y); // 1 0

    // 15)
    x = 1, y;
    y = (2 < 3) && (++x < 5);
    printf("x=%d y=%d\n", x, y); // 2 1

    // 16)
    x = 1, y;
    y = (2 < 3) && (++x > 5);
    printf("x=%d y=%d\n", x, y); // 2 0

    // 17)
    x = 3, y;
    y = (3 > 2) || (++x > 2);
    printf("x=%d y=%d\n", x, y); // 3 1

    // 18)
    x = -2, y = -1, z = 0; int w = 1;
    a = ++x && ++y && ++z && ++w;
    printf("%d %d %d %d %d\n", x, y, z, w, a); // -1 0 0 1 0

    // 19)
    x = -2, y = -1, z = 0, w = 1, a;
    a = ++x || ++y || ++z || ++w;
    printf("%d %d %d %d %d\n", x, y, z, w, a); // -1 -1 0 1 1

    // 20)
    x = -2, y = -1, z = 0, w = 1, a;
    a = ++x && y++ && ++z || ++w;
    printf("%d %d %d %d %d\n", x, y, z, w, a); // -1 0 1 1 1

    // 21)
    i = 3, j = 2, k = 0; int r;
    r = ++i && ++j && k++;
    printf("%d %d %d %d\n", i, j, k, r); // 4 3 1 0

    //------------------------------------------------------------------------------
    // ⑨조건 연산자

    // 1)
    a = 10, b = 10;
    printf("%d\n", (a == b) ? 100 : -100);

    // 2) 절대값 계산
    i = -3;
    i = (i < 0) ? -i : i;
    printf("%d\n", i);

    // 3) 성인과 청소년 구분
    int age;
    printf("성인과 청소년 구분 프로그램입니다.\n나이를 입력하세요:");
    scanf("%d", &age);
    (age > 20) ? printf("성인입니다.\n") : printf("청소년입니다.\n");

    // 4) 홀수 판별기
    printf("홀수 판별기 입니다. 정수를 입력하세요:");
    scanf("%d", &x);
    (x % 2 == 1) ? printf("홀수입니다.\n") : printf("짝수입니다\n");

    //5)
    int max;
    printf("최대값 구하는 프로그램입니다.\n3개의 정수를 입력하시요:");
    scanf("%d %d %d", &x, &y, &z);
    max = z > ((x > y) ? x : y) ? z : ((x > y) ? x : y);
    printf("최대값은 :%d\n", max);

    //------------------------------------------------------------------------------
    // ⑩콤마 연산자
    x = (2 + 3, 5 - 3);
    printf("%d\n", x); // 2, 괄호 왼쪽 실행 후 오른쪽 실행

    //------------------------------------------------------------------------------
    //  ⑪비트 단위 연산자 : 속도가 빠르다. 정수타입만 가능.

    // 1)
    unsigned q = 5;
    j = q << 2;
    printf("%u\n", j); // 20

    // 2)
    i = 40;
    i = i >> 3;
    printf("%d\n", i);

    // 3)
    i = 0b1001, j = 012;
    i = i & j;
    printf("%o\n", i); // 10_(8)

    // 4)
    i = 011, j = 0b1010;
    i = i | j;
    printf("%x\n", i); // b

    // 5)
    i = 0b1000 + 1, j = 0b1001 & 012; // i=9, j=8
    printf("%d\n", i ^ ++j); // 0

    // 6) 16진법으로 출력
    x = 9, y = 10; // 1001 1010
    printf("비트 AND = %08X\n", x & y);  // 1000 → 00000008
    printf("비트 OR = %08X\n", x | y);   // 1011 → 0000000B
    printf("비트 XOR = %08X\n", x ^ y);  // 0011 → 00000003
    printf("비트 NOT = %08X\n", ~x);    // 0110 → FFFFFFF6
    printf("비트 >>3 = %08X\n", y >> 3);// 1010 → 0101 → 0010 → 0001 / 00000001
    printf("비트 <<3 = %08X\n", x << 3);// 1001 → 100 1000 → 00000048

    // 7) 레드 추출
    unsigned color = 0x00380000, result;
    printf("픽셀의 색: %08x\n", color);
    printf("레드 추출: %08x\n", result = (color & 0x00ff0000) >> 16);

    // 8)
    x = 0x20;
    x = x << 2;
    printf("%08x\n", x); // 00000080

    // 9) 2의 보수 프로그램
    printf("2의 보수로 변환하려는 정수를 입력하세요:");
    scanf("%d", &x);                 // 12
    x = ~x + 1;
    printf("결과 : %08x(%d)\n", x, x); // fffffff4 (12)

    //------------------------------------------------------------------------------
    // ⑫ 우선순위 연습

    // 1)
    x = 0, y = 0; 
    int result2;
    result2 = 2 > 3 || 6 > 7;  // 관계 > 논리
    printf("%d\n", result2);   // 0
    result2 = 2 || 3 && 3 > 2; // 관계 > 논리 ( && > || )
    printf("%d\n", result2);   // 1
    result2 = x = y = 1;       // 대입은 오른쪽 → 왼쪽
    printf("%d\n", result2);   // 1
    result2 = -++x + y--;     // 증감=부호(=일때, 오른→왼) > 산술 > 대입
    printf("%d %d %d\n", result2, x, y);   // -1 2 0 ←부호 연산자는 수식에만! x값 변화x
    result2 = -++x + -y++;
    printf("%d %d %d\n", result2, x, y);   // -3 3 1

    // 2) 콤마
    x = 2 + 3, 2 - 3;
    printf("%d\n", x);

    // 3)
    i = 5;
    printf("%d\n", i++ * i++);     // 25
    printf("%d\n", ++i * i++ * ++i); // 729

    // 4)
    x = 1, y = 2, z = 3;
    printf("%d\n", 3 / 5);            // 0
    printf("%d\n", 3 % 5);            // 3
    printf("%d %d\n", y *= ++x, x++); // 4 2
    printf("%d\n", 2.0 / 4);          // 0.5

    // 5)
    a = 100, b = 200, c;
    c = (a == 100 || b > 200);
    printf("%d\n", c); // 1

    // 6) 지구의 반지름? 중심각: 7.2˚, 호의 길이: 900km
    float radius, angle, l;
    printf("원의 반지름을 구하는 프로그램입니다.\n");
    printf("중심각을 입력하세요(˚):");
    scanf("%f", &angle);
    printf("호의 길이를 입력하세요(km):");
    scanf("%f", &l);
    radius = l * 360.0 / angle / (2 * 3.14);
    printf("반지름은:%.1fkm 입니다.\n", radius); // 지구의 반지름은 : 7165.6km


    return 0;
}