# 큰 수의 법칙
# 2019 국가 교육기관 코딩 테스트

# -----------------------------------------------------------------------------------------------------------
# 결과( N = 5, M = 100,000,000, K = 5) sum = 583333334
# 방법 1 -> 26.651346683502197초
# 방법 2 ->  0.0초

# -----------------------------------------------------------------------------------------------------------
import time
# 입력
N, M, K = map(int, input().split())
L = list(map(int, input().split()))
# 리스트 내림차순 정렬
start = time.time()
L.sort(reverse = True)
sum = 0

# 방법 1 -> M <= 10000 
for i in range(1, M+1):
	if i%(K+1) != 0:
		sum += L[0]
	else:
		sum += L[1]

# 방법 2 수열의 규칙성으로 구하기(반복문x)
sum += (M//(K+1)) * (L[0]*K+L[1])
sum += (M%(K+1)) * L[0]

print(sum)
print(time.time()-start)

# 알고리즘은 위대하다.....